# ლექცია 24: L24_2024-02-22

# ლექცია ჩატარდა 2024 წლის 22 თებერვალს
# თემა: Model, View, Controller

#*******************************************************************#

# საჭირო ბიბლიოთეკების შემოტანა 

import os

#*******************************************************************#

# ლექციის კოდი 

# კითხვები წინა მასალებიდან (L24_2024-02-22-)

# აქ შეიყვანე თემის დასახელება (L24_2024-02-22-)

print("\n",
	"-------------------------- part 0 --------------------------",
	"\n")



# MVC პატერნი (გაგრძელება) (L24_2024-02-22-)

print("\n",
	"-------------------------- part 1 --------------------------",
	"\n")





# ლექციის მიმდინარეობისას ჩემით აწყობილი კოდი



