# ლექცია 23: L23_2024-02-19

# ლექცია ჩატარდა 2024 წლის 19 თებერვალს
# თემა: შესავალი MVC პატერნში

#*******************************************************************#

# საჭირო ბიბლიოთეკების შემოტანა 

import os

#*******************************************************************#

# ლექციის კოდი 

# კითხვები წინა მასალებიდან (L23_2024-02-19-)

# აქ შეიყვანე თემის დასახელება (L23_2024-02-19-)

print("\n",
	"-------------------------- part 0 --------------------------",
	"\n")






# მიმდინარე ლექციის თემა (L23_2024-02-19-)

print("\n",
	"-------------------------- part 1 --------------------------",
	"\n")






# ლექციის მიმდინარეობისას ჩემით აწყობილი კოდი

