# ლექცია 23: L23_2024-02-19

# ლექცია ჩატარდა 2024 წლის 19 თებერვალს
# თემა: შესავალი MVC პატერნში

#*******************************************************************#

# საჭირო ბიბლიოთეკების შემოტანა 

import os

#*******************************************************************#

# ლექციის კოდი 

# ლექციის გეგმაა, რომ ავაწყოთ flask-ის მინიმალური აპლიკაცია და 
# პრაქტიკული მაგალითის საფუძველზე განვიხილოთ და ავხსნათ MVC
# პატერნი.

# მინიმალური flask აპლიკაცია, რაც ლექციაზე გავაკეთეთ არის
# საქაღალდეში სახელად mini_flask_app.


