# ლექცია 30: L30_2024-03-28

# ლექცია ჩატარდა 2024 წლის 28 მარტს
# თემა: 1. UDP ჩათის აწყობა
#       2.მრავალგანშშტოებიანი და ასინქრონული ექო სერვერის
#         რეალიზაცია

#*******************************************************************#

# საჭირო ბიბლიოთეკების შემოტანა 


#*******************************************************************#

# ლექციის კოდი



# მეორე ნაწილი (L30_2024-03-28_01-13-06)


# საჭირო ბიბლიოთეკების შემოტანა

import asyncio


#  2. მრავალგანშშტოებიანი და ასინქრონული ექო სერვერის რეალიზაცია

