# დავალება 26

# შემსრულებელი: გიორგი ცუცქირიძე

# ეს დავალება მოგვცეს 26 ლექციაზე, რომელიც ჩატარდა 
# 2024-03-11-ში და დავალების ჩაბარების ბოლო ვადაა 2024-03-18.

#******************************************************************#

print("\n",
      "-------------------- სავარჯიშო 1 --------------------", "\n")

## სავარჯიშო 1

# მოცემულ კლასს მოარგე Single Responsibility პრინციპი და 
# შესაბამისად შეცვალე კოდი. კერძოდ, დაშალე 4 კლასად:
#  User,  Storage,  HttpConnection,  Logger

class  User:
    def __init__(self, name):
        self.name = name

    def get_name(self):
        return self.name

    def save(self):
        ...

    def send(self):
        ...

    def log(self):
        ...


# SRP პრინციპის მორგება
        
class User:
    def __init__(self, name):
        self.name = name

    def get_name(self):
        return self.name




#------------------------------------------------------------------#

print("\n",
      "-------------------- სავარჯიშო 2 --------------------", "\n")

## სავარჯიშო 2




#------------------------------------------------------------------#

print("\n",
      "-------------------- სავარჯიშო 3 --------------------", "\n")

## სავარჯიშო 3




#------------------------------------------------------------------#

print("\n",
      "-------------------- სავარჯიშო 3 --------------------", "\n")

## სავარჯიშო 4




#------------------------------------------------------------------#