# ლექცია 27: L27_2024-03-14

# ლექცია ჩატარდა 2024 წლის 14 მარტს
# თემა: მოდულარული ტესტირება/Modular Tsting

#*******************************************************************#

# საჭირო ბიბლიოთეკების შემოტანა 

import os

#*******************************************************************#

# ლექციის კოდი 

# ლექციის კოდი წარმოდგენილია შემდეგ ფაილებში:

# 1. calc.py
# 2. test_calc.py
# 3. employee.py
# 4. test_employee.py
# 5. exercises

# ფაილები დანომრილია ლექციის მიმდინარეობისას მათი შექმნის 
# რიგითობის მიხედვით.