# ლექცია 26: L26_2024-03-14

# ლექცია ჩატარდა 2024 წლის 14 მარტს
# თემა: მოდულარული ტესტირება/Modular Tsting

#*******************************************************************#

# საჭირო ბიბლიოთეკების შემოტანა 

import os

#*******************************************************************#

# ლექციის კოდი 

# კითხვები წინა მასალებიდან (L24_2024-02-22-)

# აქ შეიყვანე თემის დასახელება (L24_2024-02-22-)

print("\n",
	"-------------------------- part 0 --------------------------",
	"\n")


# მიმდინარე ლექციის თემა (L27_2024-03-14-)

print("\n",
	"-------------------------- part 1 --------------------------",
	"\n")

# print(os.getcwd())
# os.chdir("./Lectures/L27_2024-03-14")  # სამუშაო დირექტორიის შეცვლა.
# print(os.getcwd())




# ლექციის მიმდინარეობისას ჩემით აწყობილი კოდი
